<?php if (!defined('__TYPECHO_ROOT_DIR__')) exit; ?>
<div id="typed-strings">
<?php
    $random = mt_rand(1,10);
    switch ($random) {
        case '1':
            echo "<p>很多东西宁缺毋滥，流星的光芒短暂而灼热闪耀。</p>";
            echo "<p>让你变得更好的那个人，往往是你觉得很难与之相处的那个人。—— by 小宇</p>";
            echo "<p>觉得自己做的到和不做的到，其实只在一念之间。</p>";
            echo "<p>路在自己脚下，没有人可以决定我的方向。</p>";
            echo "<p>你的选择是做或不做，但不做就永远不会有机会。</p>";
            echo "<p>凡事顺其自然，遇事处于泰然，得意之时淡然，失意之时坦然，艰辛曲折必然，历尽沧桑悟然。</p>";
            break;
        case '2':
            echo "<p>生命要得到丰盛的收获，必需阳光；同时，也需要“雨”的浇灌。</p>";
            echo "<p>人生应该树立目标，否则你的精力会白白浪费。</p>";
            echo "<p>山涧的泉水经过一路曲折,才唱出一支美妙的歌。</p>";
            echo "<p>如若不是为了一个人，谁肯枯守一座城。城市和爱情，总是有着这样那样的关系。我们会因为一个人，去到那座城，因为那是一座爱的城；我们也会因为一个人，离开一座城，那是一座绝望的伤城。</p>";
            echo "<p>常求有利别人，不求有利自己。</p>";
            break;
        case '3':
            echo "<p>无论有多困难，都坚强地抬头挺胸，告诉所有人，你并非他们想象的那样不堪一击。</p>";
            echo "<p>每个人心里都有一段伤痕，时间才是最好的疗剂。</p>";
            echo "<p>人总是珍惜未得到的，而遗忘了所拥有的。</p>";
            echo "<p>退一步，并不象征我认输；放手，并不表示我放弃；微笑，并不意味我快乐！</p>";
            echo "<p>人海中再回首，朋友真诚依旧，生命里重逢，心境平和温柔，往事如风，岁月如歌，漫漫人生路，苍桑几许，幸福几何！</p>";
            break;
        case '4':
            echo "<p>要铭记在心：每天都是一年中最美好的日子。</p>";
            echo "<p>生活远没有咖啡那么苦涩，关键是喝它的人怎么品味！每个人都喜欢和向往随心所欲的生活，殊不知随心所欲根本不是生活。</p>";
            echo "<p>如果错过了太阳时你流泪了，那么你也要错过群星了。</p>";
            echo "<p>不如意的时候不要尽往悲伤里钻，想想有笑声的日子吧。</p>";
            echo "<p>我不明白为什么要那么在意别人的看法，评头论足只是无聊人的消遣，何必看得如临大敌。如果你不吃别人家的饭，就别太把别人的话放在心上。</p>";
            break;
        case '5':
            echo "<p>青春就是用来追忆的，当你怀揣着它时，它一文不值，只有将它耗尽后，再回过头看，一切才有了意义，爱过我们的人和伤害过我们的人，都是我们青春存在的意义。</p>";
            echo "<p>既然活着来到这个世界，就没有打算活着回去。所以，在这有限的时间里，我们应该珍惜生命，珍惜机会，更要珍惜那得之不易的时间。因那滴答做响的时间脚步，一旦走过，再不回头。</p>";
            echo "<p>青春是一个充满魁力，充满诱惑的时代。好动是青春，好奇是青春，好玩是青春。玩世不恭更是青春，我们的一切切都是青春。</p>";
            echo "<p>要先打败任何事情得先学会打败自己。</p>";
            echo "<p>我会把每一次改变当做成长，哪怕是痛也值得。</p>";
            break;
        case '6':
            echo "<p>有种脾气叫，不放弃。</p>";
            echo "<p>梦想是注定孤独的旅行，路上少不了质疑和嘲笑，但那又怎样，哪怕遍体鳞伤也要活的漂亮。</p>";
            echo "<p>不管现在有多么艰辛，我们也要做个生活的舞者。</p>";
            echo "<p>命运从来不会同情弱者。</p>";
            echo "<p>不怕万人阻挡在前方，只怕自己先行投降。</p>";
            break;
        case '7':
            echo "<p>生活其实很简单，过了今天就是明天。</p>";
            echo "<p>低头哭过别忘了抬头继续走。</p>";
            echo "<p>不要被任何人打乱自的脚步，因为没有谁会像你一样清楚和在乎自己梦想。</p>";
            echo "<p>没有人可以打倒我，除非我自己先趴下!</p>";
            echo "<p>你要记住你不是为别人而活，你是为自己而活。</p>";
            break;
        case '8':
            echo "<p>只有脚踏实地的人，才能够说：路，就在我的脚下。</p>";
            echo "<p>无论你选择做什么，追求完美的程度决定你成就的高度。</p>";
            echo "<p>这个世界最脆弱的是生命，身体健康，很重要。</p>";
            echo "<p>上帝说：你要什么便取什么，但是要付出相当的代价。</p>";
            echo "<p>现在站在什么地方不重要，重要的是你往什么方向移动。</p>";
            break;
        case '9':
            echo "<p>成功源于不懈的努力。</p>";
            echo "<p>暗自伤心，不如立即行动。</p>";
            echo "<p>再多一点努力，就多一点成功。</p>";
            echo "<p>得意淡然，失意坦然；喜而不狂，忧而不伤。</p>";
            echo "<p>海纳百川，有容乃大；壁立千仞，无欲则刚。</p>";
            break;
        case '10':
            echo "<p>快乐地过是一天，不快乐地过也是一天，我为什么不快快乐乐地过每一天呢？</p>";
            echo "<p>岂能尽随人愿，但求无愧我心。</p>";
            echo "<p>在你内心深处，还有无穷的潜力，有一天当你回首看时，你就会知道这绝对是真的。</p>";
            echo "<p>活在当下，别在怀念过去或者憧憬未来中浪费掉你现在的生活。</p>";
            echo "<p>挫折时，要像大树一样，被砍了，还能再长；也要像杂草一样，虽让人践踏，但还能勇敢地活下去。</p>";
            break;        
        default:
            echo "<p>更改你喜欢的短语请直接替换各个case中的内容即可！</p>";
            break;
    }
?>
</div>